This doesn't seem to be an issue with all resources. I can replicate the issue with `aws_s3_bucket` but not with `aws_sns_topic`. SNS topics do appear to correctly allow tags with an empty string as the value. The original issue that documented this is #24449 which is sadly locked so I cannot reference this there, but that does not appear to be working correctly. I did run these tests on version 5.0.0 as well to see if it was a regression since that release but I got the same results.

A particularly interesting INFO log line is (`Project` being the tag I've been testing with):

```
2023-06-30T13:34:24.385+0100 [WARN]  Provider "provider[\"registry.terraform.io/hashicorp/aws\"]" produced an unexpected new value for aws_s3_bucket.this, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .tags: element "Project" has vanished
```

Full reproduction code and output below. You can see that everything applies correctly, and on the second plan it attempts again to add the tag to the bucket but not to the SNS topic. I have redacted my AWS account ID to 999999999.

```terraform
# main.tf
resource "aws_s3_bucket" "this" {
  bucket = "4c59cf5d-0310-4b37-be46-a34e90f065f1"
  tags = {
    Project = ""
  }
}

resource "aws_sns_topic" "this" {
  name = "4fa33a6b-2c7a-41c9-9f05-e30176276ce8"
  tags = {
    Project = ""
  }
}
```

```
$ terraform version
Terraform v1.5.2
on linux_amd64
+ provider registry.terraform.io/hashicorp/aws v5.6.1

$ TF_LOG=info terraform apply -auto-approve
2023-06-30T13:34:18.803+0100 [INFO]  Terraform version: 1.5.2
2023-06-30T13:34:18.803+0100 [INFO]  Go runtime version: go1.20
2023-06-30T13:34:18.803+0100 [INFO]  CLI args: []string{"/home/oca/bin/tfenv/versions/1.5.2/terraform", "apply", "-auto-approve"}
2023-06-30T13:34:18.803+0100 [INFO]  CLI command args: []string{"apply", "-auto-approve"}
2023-06-30T13:34:19.725+0100 [INFO]  backend/local: starting Apply operation
2023-06-30T13:34:19.726+0100 [INFO]  provider: configuring client automatic mTLS
2023-06-30T13:34:19.865+0100 [INFO]  provider.terraform-provider-aws_v5.6.1_x5: configuring server automatic mTLS: timestamp=2023-06-30T13:34:19.865+0100
2023-06-30T13:34:20.573+0100 [INFO]  provider: configuring client automatic mTLS
2023-06-30T13:34:20.738+0100 [INFO]  provider.terraform-provider-aws_v5.6.1_x5: configuring server automatic mTLS: timestamp=2023-06-30T13:34:20.737+0100
2023-06-30T13:34:21.275+0100 [INFO]  backend/local: apply calling Plan
2023-06-30T13:34:21.276+0100 [INFO]  provider: configuring client automatic mTLS
2023-06-30T13:34:21.433+0100 [INFO]  provider.terraform-provider-aws_v5.6.1_x5: configuring server automatic mTLS: timestamp=2023-06-30T13:34:21.432+0100
2023-06-30T13:34:22.005+0100 [INFO]  provider.terraform-provider-aws_v5.6.1_x5: Retrieved credentials: @module=aws.aws-base tf_aws.credentials_source=EnvConfigCredentials tf_provider_addr=registry.terraform.io/hashicorp/aws @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.30/logging/logger.go:33 tf_mux_provider=*schema.GRPCProviderServer tf_req_id=0a284871-c95f-2b58-a418-d088e5f6cffd tf_rpc=ConfigureProvider timestamp=2023-06-30T13:34:22.005+0100
2023-06-30T13:34:22.148+0100 [INFO]  provider.terraform-provider-aws_v5.6.1_x5: Retrieved caller identity from STS: tf_provider_addr=registry.terraform.io/hashicorp/aws @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.30/logging/logger.go:33 @module=aws.aws-base tf_mux_provider=*schema.GRPCProviderServer tf_req_id=0a284871-c95f-2b58-a418-d088e5f6cffd tf_rpc=ConfigureProvider timestamp=2023-06-30T13:34:22.147+0100
2023-06-30T13:34:22.173+0100 [INFO]  provider.terraform-provider-aws_v5.6.1_x5: Retrieved caller identity from STS: tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=0a284871-c95f-2b58-a418-d088e5f6cffd @module=aws.aws-base tf_mux_provider=*schema.GRPCProviderServer tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.30/logging/logger.go:33 timestamp=2023-06-30T13:34:22.173+0100
2023-06-30T13:34:22.189+0100 [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_sns_topic.this, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .fifo_topic: planned value cty.False for a non-computed attribute
      - .content_based_deduplication: planned value cty.False for a non-computed attribute
2023-06-30T13:34:22.197+0100 [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_s3_bucket.this, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .force_destroy: planned value cty.False for a non-computed attribute
      - .versioning: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .cors_rule: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .replication_configuration: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .logging: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .object_lock_configuration: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .server_side_encryption_configuration: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .website: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .grant: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .lifecycle_rule: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "4c59cf5d-0310-4b37-be46-a34e90f065f1"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Project" = ""
        }
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_sns_topic.this will be created
  + resource "aws_sns_topic" "this" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "4fa33a6b-2c7a-41c9-9f05-e30176276ce8"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "Project" = ""
        }
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
2023-06-30T13:34:22.288+0100 [INFO]  backend/local: apply calling Apply
2023-06-30T13:34:22.289+0100 [INFO]  provider: configuring client automatic mTLS
2023-06-30T13:34:22.439+0100 [INFO]  provider.terraform-provider-aws_v5.6.1_x5: configuring server automatic mTLS: timestamp=2023-06-30T13:34:22.439+0100
2023-06-30T13:34:23.004+0100 [INFO]  provider.terraform-provider-aws_v5.6.1_x5: Retrieved credentials: @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.30/logging/logger.go:33 tf_aws.credentials_source=EnvConfigCredentials tf_req_id=9c8996d2-b998-e4e9-6b8b-55349852476b @module=aws.aws-base tf_mux_provider=*schema.GRPCProviderServer tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=ConfigureProvider timestamp=2023-06-30T13:34:23.004+0100
2023-06-30T13:34:23.140+0100 [INFO]  provider.terraform-provider-aws_v5.6.1_x5: Retrieved caller identity from STS: tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.30/logging/logger.go:33 @module=aws.aws-base tf_mux_provider=*schema.GRPCProviderServer tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=9c8996d2-b998-e4e9-6b8b-55349852476b timestamp=2023-06-30T13:34:23.140+0100
2023-06-30T13:34:23.164+0100 [INFO]  provider.terraform-provider-aws_v5.6.1_x5: Retrieved caller identity from STS: @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.30/logging/logger.go:33 tf_mux_provider=*schema.GRPCProviderServer tf_req_id=9c8996d2-b998-e4e9-6b8b-55349852476b @module=aws.aws-base tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=ConfigureProvider timestamp=2023-06-30T13:34:23.164+0100
2023-06-30T13:34:23.186+0100 [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_sns_topic.this, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .fifo_topic: planned value cty.False for a non-computed attribute
      - .content_based_deduplication: planned value cty.False for a non-computed attribute
aws_sns_topic.this: Creating...
2023-06-30T13:34:23.186+0100 [INFO]  Starting apply for aws_sns_topic.this
2023-06-30T13:34:23.197+0100 [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_s3_bucket.this, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .force_destroy: planned value cty.False for a non-computed attribute
      - .cors_rule: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .replication_configuration: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .versioning: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .website: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .grant: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .lifecycle_rule: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .logging: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .object_lock_configuration: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .server_side_encryption_configuration: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
aws_s3_bucket.this: Creating...
2023-06-30T13:34:23.197+0100 [INFO]  Starting apply for aws_s3_bucket.this
2023-06-30T13:34:23.651+0100 [WARN]  Provider "provider[\"registry.terraform.io/hashicorp/aws\"]" produced an unexpected new value for aws_sns_topic.this, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .http_success_feedback_sample_rate: was null, but now cty.NumberIntVal(0)
      - .sqs_success_feedback_sample_rate: was null, but now cty.NumberIntVal(0)
      - .lambda_failure_feedback_role_arn: was null, but now cty.StringVal("")
      - .http_failure_feedback_role_arn: was null, but now cty.StringVal("")
      - .sqs_success_feedback_role_arn: was null, but now cty.StringVal("")
      - .firehose_failure_feedback_role_arn: was null, but now cty.StringVal("")
      - .firehose_success_feedback_sample_rate: was null, but now cty.NumberIntVal(0)
      - .lambda_success_feedback_sample_rate: was null, but now cty.NumberIntVal(0)
      - .sqs_failure_feedback_role_arn: was null, but now cty.StringVal("")
      - .application_success_feedback_role_arn: was null, but now cty.StringVal("")
      - .application_success_feedback_sample_rate: was null, but now cty.NumberIntVal(0)
      - .delivery_policy: was null, but now cty.StringVal("")
      - .http_success_feedback_role_arn: was null, but now cty.StringVal("")
      - .firehose_success_feedback_role_arn: was null, but now cty.StringVal("")
      - .application_failure_feedback_role_arn: was null, but now cty.StringVal("")
      - .display_name: was null, but now cty.StringVal("")
      - .kms_master_key_id: was null, but now cty.StringVal("")
      - .lambda_success_feedback_role_arn: was null, but now cty.StringVal("")
aws_sns_topic.this: Creation complete after 1s [id=arn:aws:sns:eu-west-1:999999999999:4fa33a6b-2c7a-41c9-9f05-e30176276ce8]
2023-06-30T13:34:24.322+0100 [WARN]  provider.terraform-provider-aws_v5.6.1_x5: [WARN] Unable to read S3 bucket (4c59cf5d-0310-4b37-be46-a34e90f065f1) Object Lock Configuration: ObjectLockConfigurationNotFoundError: Object Lock configuration does not exist for this bucket
2023-06-30T13:34:24.385+0100 [WARN]  Provider "provider[\"registry.terraform.io/hashicorp/aws\"]" produced an unexpected new value for aws_s3_bucket.this, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .tags: element "Project" has vanished
aws_s3_bucket.this: Creation complete after 1s [id=4c59cf5d-0310-4b37-be46-a34e90f065f1]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

$ terraform plan
aws_sns_topic.this: Refreshing state... [id=arn:aws:sns:eu-west-1:999999999999:4fa33a6b-2c7a-41c9-9f05-e30176276ce8]
aws_s3_bucket.this: Refreshing state... [id=4c59cf5d-0310-4b37-be46-a34e90f065f1]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
        id                          = "4c59cf5d-0310-4b37-be46-a34e90f065f1"
      ~ tags                        = {
          + "Project" = ""
        }
      ~ tags_all                    = {} -> (known after apply)
        # (9 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

$ aws s3api get-bucket-tagging --bucket 4c59cf5d-0310-4b37-be46-a34e90f065f1

An error occurred (NoSuchTagSet) when calling the GetBucketTagging operation: The TagSet does not exist

$ aws sns list-tags-for-resource --resource-arn arn:aws:sns:eu-west-1:999999999999:4fa33a6b-2c7a-41c9-9f05-e30176276ce8
{
    "Tags": [
        {
            "Key": "Project",
            "Value": ""
        }
    ]
}
```